# 5 most popular baby names in the US in 2014

In [53]:
import pandas as pd
import glob

In [54]:
# get data file names
path = r'Exercise Files'
filenames = glob.glob(path + "/us_baby_names_*.csv")

dfs = []
for filename in filenames:
    dfs.append(pd.read_csv(filename))

# Concatenate all data into one DataFrame
babies = pd.concat(dfs, ignore_index=True)

In [55]:
babies.shape

(1825433, 5)

In [56]:
babies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1825433 entries, 0 to 1825432
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   Id      int64
 1   Name    object
 2   Year    int64
 3   Gender  object
 4   Count   int64
dtypes: int64(3), object(2)
memory usage: 69.6+ MB

In [57]:
babies.describe()

                 Id          Year         Count
count  1.825433e+06  1.825433e+06  1.825433e+06
mean   9.127170e+05  1.972620e+03  1.846879e+02
std    5.269573e+05  3.352891e+01  1.566711e+03
min    1.000000e+00  1.880000e+03  5.000000e+00
25%    4.563590e+05  1.949000e+03  7.000000e+00
50%    9.127170e+05  1.982000e+03  1.200000e+01
75%    1.369075e+06  2.001000e+03  3.200000e+01
max    1.825433e+06  2.014000e+03  9.968000e+04

In [58]:
babies['Year'].value_counts()

2008    35045
2007    34931
2009    34684
2006    34069
2010    34041
        ...
1885     2294
1882     2127
1883     2084
1880     2000
1881     1935
Name: Year, Length: 135, dtype: int64

In [59]:
# Find columns with missing values
babies.isnull().sum()

Id        0
Name      0
Year      0
Gender    0
Count     0
dtype: int64

In [62]:
babies_2014 = babies[babies['Year'] == 2014]

In [63]:
babies_2014.head()

              Id      Name  Year Gender  Count
1792389  1792390      Emma  2014      F  20799
1792390  1792391    Olivia  2014      F  19674
1792391  1792392    Sophia  2014      F  18490
1792392  1792393  Isabella  2014      F  16950
1792393  1792394       Ava  2014      F  15586

In [64]:
babies_2014 = babies_2014.sort_values('Count', ascending=False)

In [65]:
babies_2014.head(5)

              Id    Name  Year Gender  Count
1792389  1792390    Emma  2014      F  20799
1792390  1792391  Olivia  2014      F  19674
1811456  1811457    Noah  2014      M  19144
1792391  1792392  Sophia  2014      F  18490
1811457  1811458    Liam  2014      M  18342

In [66]:
babies_2014.iloc[0:5]

              Id    Name  Year Gender  Count
1792389  1792390    Emma  2014      F  20799
1792390  1792391  Olivia  2014      F  19674
1811456  1811457    Noah  2014      M  19144
1792391  1792392  Sophia  2014      F  18490
1811457  1811458    Liam  2014      M  18342

In [67]:
# 5 most popular baby names in California in 2014

In [68]:
# get data file names
path = r'Exercise Files'
filenames = glob.glob(path + "/state_baby_names_*.csv")

dfs = []
for filename in filenames:
    dfs.append(pd.read_csv(filename))

# Concatenate all data into one DataFrame
states_babies = pd.concat(dfs, ignore_index=True)

In [70]:
states_babies.head()

        Id      Name  Year Gender State  Count
0  3999994     Perry  1960      M    OH    133
1  3999995      Kent  1960      M    OH    130
2  3999996       Ray  1960      M    OH    130
3  3999997       Ted  1960      M    OH    130
4  3999998  Clifford  1960      M    OH    128

In [74]:
states_babies[states_babies['State'] == 'CA']

             Id      Name  Year Gender State  Count
2003450  356018      Mary  1910      F    CA    295
2003451  356019     Helen  1910      F    CA    239
2003452  356020   Dorothy  1910      F    CA    220
2003453  356021  Margaret  1910      F    CA    163
2003454  356022   Frances  1910      F    CA    134
...         ...       ...   ...    ...   ...    ...
2357658  710226    Zakary  2014      M    CA      5
2357659  710227   Zealand  2014      M    CA      5
2357660  710228      Ziad  2014      M    CA      5
2357661  710229    Zidane  2014      M    CA      5
2357662  710230     Ziyad  2014      M    CA      5

[354213 rows x 6 columns]

In [80]:
state_babies = states_babies[states_babies['State'] == 'CA']

In [81]:
state_babies.head()

             Id      Name  Year Gender State  Count
2003450  356018      Mary  1910      F    CA    295
2003451  356019     Helen  1910      F    CA    239
2003452  356020   Dorothy  1910      F    CA    220
2003453  356021  Margaret  1910      F    CA    163
2003454  356022   Frances  1910      F    CA    134

In [83]:
state_babies = state_babies[states_babies['Year'] == 2014].sort_values('Count', ascending = False)

In [84]:
state_babies.head()

             Id      Name  Year Gender State  Count
2208928  561496    Sophia  2014      F    CA   3162
2354744  707312      Noah  2014      M    CA   2761
2208929  561497  Isabella  2014      F    CA   2705
2354745  707313     Jacob  2014      M    CA   2692
2208930  561498      Emma  2014      F    CA   2662

# Most popular female/male baby names by year

In [85]:
# get data file names
path = r'Exercise Files'
filenames = glob.glob(path + "/state_baby_names_*.csv")

dfs = []
for filename in filenames:
    dfs.append(pd.read_csv(filename))

# Concatenate all data into one DataFrame
states_babies = pd.concat(dfs, ignore_index=True)

In [86]:
states_babies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647426 entries, 0 to 5647425
Data columns (total 6 columns):
 #   Column  Dtype
---  ------  -----
 0   Id      int64
 1   Name    object
 2   Year    int64
 3   Gender  object
 4   State   object
 5   Count   int64
dtypes: int64(3), object(3)
memory usage: 258.5+ MB

In [91]:
states_babies = states_babies.groupby('Year').sort_values('Count', ascending=False)

AttributeError: 'DataFrameGroupBy' object has no attribute 'sort_values'

In [92]:
states_babies.head()

        Id      Name  Year Gender State  Count
0  3999994     Perry  1960      M    OH    133
1  3999995      Kent  1960      M    OH    130
2  3999996       Ray  1960      M    OH    130
3  3999997       Ted  1960      M    OH    130
4  3999998  Clifford  1960      M    OH    128